// Исключения — это специальный тип объектов, которые создаются при
// возникновении ошибочной ситуации и выбрасываются Java-машиной.

// Код ошибки — целочисленный код, указывающий на причину ошибки. Для
// разных приложений — разные коды ошибок.

// Откуда берутся ошибки:
// 1. Разработчик не учёл ситуацию, которая привела к ошибке.
// 2. При работе приложения внешняя среда так изменила состояние,
// что программа не может дальше корректно выполнять операцию.
// 3. В используемых библиотеках есть баги, которые не позволяют
// корректно выполнять задачу.

// бросить исключение - используется ключевое слово throw («бросить»)

public class Lec_01 {
  public static void main(String[] args) {
    


  }
}